lvx/base/InformationRegisters/бит_НастройкиДоступностиЭлементов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиДоступностиЭлементов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УбратьВидимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеБлокироватьСостояниемДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыЭлементовУправления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроизвольноеУсловие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЭлементаУправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Enums/бит_ВидыЭлементовУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыЭлементовУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВсяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолеФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КнопкаФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекорацияФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоманднаяПанель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/InformationRegisters/бит_НастройкиДоступностиЭлементов/Forms/ГрупповаяНастройкаДоступности/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектСистемы = Параметры.ОбъектСистемы;
	Пользователь  = Параметры.Пользователь;
	
	ОтображатьСписком = Истина;
	
	ЗаполнитьСписокОбъектовСистемы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьЭлементыНастройкиДоступности(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектСистемыПриИзменении(Элемент)
	
	СформироватьЭлементыНастройкиДоступности();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	СформироватьЭлементыНастройкиДоступности();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКоллекцияЭлементов

&НаКлиенте
Процедура КоллекцияЭлементовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.КоллекцияЭлементов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ИмяТекущегоЭлемента = ТекущиеДанные.ИмяЭлемента;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоллекцияЭлементовУбратьВидимостьПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.КоллекцияЭлементов.ТекущиеДанные;
	ТекущаяСтрока.ТолькоПросмотр = Ложь;
	ТекущаяСтрока.Обязательное   = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КоллекцияЭлементовТолькоПросмотрПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.КоллекцияЭлементов.ТекущиеДанные;
	ТекущаяСтрока.УбратьВидимость = Ложь;
	ТекущаяСтрока.Обязательное    = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КоллекцияЭлементовОбязательноеПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.КоллекцияЭлементов.ТекущиеДанные;
	ТекущаяСтрока.ТолькоПросмотр  = Ложь;
	ТекущаяСтрока.УбратьВидимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаРежимПросмотра(Команда)
	
	ОтображатьСписком = НЕ ОтображатьСписком;
	СформироватьЭлементыНастройкиДоступности();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьИзменения(Команда)
	
	СохранитьНастройкиДоступности();
	Оповестить("Запись_бит_НастройкиДоступностиЭлементов");
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокОбъектовСистемы()
	
	ОбъектыНастройки = бит_НастройкиДоступностиЭлементовФорм.ОбъектыНастройкиДоступностиЭлементов();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыСистемы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК ОбъектыСистемы
	|ГДЕ
	|	ОбъектыСистемы.Ссылка В(&ОбъектыСистемы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектыСистемы.Наименование";
	Запрос.УстановитьПараметр("ОбъектыСистемы", ОбъектыНастройки);

	МассивОбъектов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Элементы.ОбъектСистемы.СписокВыбора.ЗагрузитьЗначения(МассивОбъектов);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЭлементыНастройкиДоступности(Отказ = Ложь)
	
	Элементы.КоллекцияЭлементовКомандаРежимПросмотра.Пометка = ОтображатьСписком;
	
	СтрокиДереваПервогоУровня = ДеревоЭлементов.ПолучитьЭлементы();
	СтрокиДереваПервогоУровня.Очистить();
	
	Если НЕ ЗначениеЗаполнено(ОбъектСистемы)
		ИЛИ НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли;
	
	ФормаПолучена = Ложь;
	
	АдресТаблицыРеквизитовФормы = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ИмяФормыОбъекта = бит_УправлениеОбъектамиСистемыВызовСервера.ПолучитьФормуОбъекта(ОбъектСистемы);
	ПараметрыФормы  = Новый Структура;
	ПараметрыФормы.Вставить("АнализЭлементовУправленияФормы", Истина);
	ПараметрыФормы.Вставить("АдресТаблицыРеквизитовФормы",    АдресТаблицыРеквизитовФормы);
	
	Если ТипЗнч(ИмяФормыОбъекта) = Тип("Строка") Тогда
		Попытка
			// АПК:65-выкл. Использован метод ПолучитьФорму вместо ОткрытьФорму, т.к. требуется ее закрытие после анализа реквизитов. 
			ФормаОбъекта = ПолучитьФорму(ИмяФормыОбъекта, ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
			// АПК:65-вкл
			ФормаОбъекта.Открыть();
			Если ФормаОбъекта.Открыта() Тогда
				ФормаОбъекта.Закрыть();
			КонецЕсли;
			ФормаПолучена = Истина;
		Исключение
			ФормаПолучена = Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если Не ФормаПолучена Тогда
		ТекстСообщения = НСтр("en = 'Невозможно получить доступ к элементам формы.';
								  |ru = 'Невозможно получить доступ к элементам формы.'"); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли;
		
	СвойстваРеквизитов = ЗаполнитьИсключенияИПолучитьОписаниеСвойствРеквизитов();
	
	СтрокаЭлемента = СтрокиДереваПервогоУровня.Добавить();
	СтрокаЭлемента.Представление  = НСтр("ru='Форма';en='Form'");
	СтрокаЭлемента.ИмяЭлемента    = "ВсеЭлементыФормы";
	СтрокаЭлемента.ВидЭлемента    = ПредопределенноеЗначение("Перечисление.бит_ВидыЭлементовУправления.ВсяФорма");
	ЗаполнитьПараметрыСтрокиЭлемента(СтрокаЭлемента, СвойстваРеквизитов);
	
	ДобавитьПодчиненныеЭлементы(СтрокаЭлемента, ФормаОбъекта, СвойстваРеквизитов, СтрокаЭлемента);
	Если ОтображатьСписком Тогда
		УпорядочитьЭлементыПоПредставлению(СтрокаЭлемента.ПолучитьЭлементы());
	КонецЕсли;
	ДобавитьДополнительныеРеквзиты(СтрокаЭлемента, СвойстваРеквизитов);
	
	УстановитьУсловноеОформление();
	
	Элементы.КоллекцияЭлементов.ТекущаяСтрока = ИдентификаторСтрокиТекущегоЭлемента;
	
	Элементы.КоллекцияЭлементов.Развернуть(СтрокаЭлемента.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодчиненныеЭлементы(СрокаДерева, ЭлементВладелец, СвойстваРеквизитов, СтрокаПервогоУровня)

	ШаблонПредставления = "%1 (%2)";
	
	ПодчиненныеСтроки = СрокаДерева.ПолучитьЭлементы();
	
	Для каждого ЭлементУправления Из ЭлементВладелец.ПодчиненныеЭлементы Цикл
		Если ОтображатьСписком
			И ТипЗнч(ЭлементУправления) = Тип("ГруппаФормы") Тогда
			ДобавитьПодчиненныеЭлементы(СтрокаПервогоУровня, ЭлементУправления, СвойстваРеквизитов, СтрокаПервогоУровня);
		Иначе
			ПодсказкаЭлемента = "";
			
			НоваяСтрока = ПодчиненныеСтроки.Добавить();
			НоваяСтрока.ИмяЭлемента   = ЭлементУправления.Имя;
			НоваяСтрока.Представление = ЭлементУправления.Заголовок;
			Если ТипЗнч(ЭлементУправления) = Тип("ГруппаФормы") Тогда
				НоваяСтрока.ВидЭлемента = ПредопределенноеЗначение("Перечисление.бит_ВидыЭлементовУправления.ГруппаФормы");
				ДобавитьПодчиненныеЭлементы(НоваяСтрока, ЭлементУправления, СвойстваРеквизитов, СтрокаПервогоУровня);
			ИначеЕсли ТипЗнч(ЭлементУправления) = Тип("ДекорацияФормы") Тогда
				НоваяСтрока.ВидЭлемента = ПредопределенноеЗначение("Перечисление.бит_ВидыЭлементовУправления.ДекорацияФормы");
			ИначеЕсли ТипЗнч(ЭлементУправления) = Тип("ПолеФормы") Тогда
				НоваяСтрока.ВидЭлемента = ПредопределенноеЗначение("Перечисление.бит_ВидыЭлементовУправления.ПолеФормы");
				ПодсказкаЭлемента = ЭлементУправления.Подсказка;
			ИначеЕсли ТипЗнч(ЭлементУправления) = Тип("КнопкаФормы") Тогда
				НоваяСтрока.ВидЭлемента = ПредопределенноеЗначение("Перечисление.бит_ВидыЭлементовУправления.КнопкаФормы");
			ИначеЕсли ТипЗнч(ЭлементУправления) = Тип("ТаблицаФормы") Тогда
				НоваяСтрока.ВидЭлемента = ПредопределенноеЗначение("Перечисление.бит_ВидыЭлементовУправления.ТаблицаФормы");
				ДобавитьПодчиненныеЭлементы(НоваяСтрока, ЭлементУправления, СвойстваРеквизитов, СтрокаПервогоУровня);
			Иначе
				ВызватьИсключение НСтр("ru = 'Не обрабатываемый тип элемента управления'");
			КонецЕсли;
			НоваяСтрока.Исключение = ИсключенияНастройкиДоступности.НайтиПоЗначению(ЭлементУправления.Имя) <> Неопределено;
			
			ЗаполнитьПараметрыСтрокиЭлемента(НоваяСтрока, СвойстваРеквизитов);
			
			Если НЕ ПустаяСтрока(ПодсказкаЭлемента) И НоваяСтрока.Представление <> ПодсказкаЭлемента Тогда
				НоваяСтрока.Представление = СтрШаблон(ШаблонПредставления, НоваяСтрока.Представление, ПодсказкаЭлемента);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыСтрокиЭлемента(СтрокаЭлемента, СвойстваРеквизитов)
	
	СтрокаЭлемента.ИндексКартинки = ИндексКартинкиПоВидуЭлемента(СтрокаЭлемента.ВидЭлемента);
	
	ПараметрыРеквизита = СвойстваРеквизитов.ПараметрыКонфигурации.Получить(СтрокаЭлемента.ИмяЭлемента);
	Если ПараметрыРеквизита <> Неопределено Тогда
		СтрокаЭлемента.ИмяРеквизита = ПараметрыРеквизита.ПутьКДанным;
		Если ПустаяСтрока(СтрокаЭлемента.Представление) Тогда
			СтрокаЭлемента.Представление = ПараметрыРеквизита.Синоним;
		КонецЕсли;
	КонецЕсли;
	Если ПустаяСтрока(СтрокаЭлемента.Представление) Тогда
		СтрокаЭлемента.Представление = СтрокаЭлемента.ИмяЭлемента;
	КонецЕсли;
	
	ПользовательскиеНастройки = СвойстваРеквизитов.ПользовательскиеНастройки.Получить(СтрокаЭлемента.ИмяЭлемента);
	Если ПользовательскиеНастройки <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(СтрокаЭлемента, ПользовательскиеНастройки);
	КонецЕсли;
	
	Если СтрокаЭлемента.ИмяЭлемента = ИмяТекущегоЭлемента Тогда
		ИдентификаторСтрокиТекущегоЭлемента = СтрокаЭлемента.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ИндексКартинкиПоВидуЭлемента(ВидЭлементаУправления)
	
	Если ВидЭлементаУправления = ПредопределенноеЗначение("Перечисление.бит_ВидыЭлементовУправления.ВсяФорма") Тогда
		Возврат 1;
	ИначеЕсли ВидЭлементаУправления = ПредопределенноеЗначение("Перечисление.бит_ВидыЭлементовУправления.ГруппаФормы") Тогда
		Возврат 2;
	ИначеЕсли ВидЭлементаУправления = ПредопределенноеЗначение("Перечисление.бит_ВидыЭлементовУправления.ПолеФормы") Тогда
		Возврат 3;
	ИначеЕсли ВидЭлементаУправления = ПредопределенноеЗначение("Перечисление.бит_ВидыЭлементовУправления.ТаблицаФормы") Тогда
		Возврат 4;
	ИначеЕсли ВидЭлементаУправления = ПредопределенноеЗначение("Перечисление.бит_ВидыЭлементовУправления.КнопкаФормы") Тогда
		Возврат 6;
	ИначеЕсли ВидЭлементаУправления = ПредопределенноеЗначение("Перечисление.бит_ВидыЭлементовУправления.ДекорацияФормы") Тогда
		Возврат 7;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Функция ЗаполнитьИсключенияИПолучитьОписаниеСвойствРеквизитов()
	
	// Функция из нескольких действий для того чтобы сократить количество вызовов клиент-сервер.
	ЗаполнитьИсключения();
	Возврат ОписаниеСвойствРеквизитов();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьИсключения()
	
	ИсключенияНастройкиДоступности.Очистить();
	
	ЭлементыИсключения = бит_НастройкиДоступностиЭлементовФорм.ЭлементыИсключенияНастройкиДоступности(ОбъектСистемы);
	Для каждого Элемент Из ЭлементыИсключения Цикл
		ЗаполнитьЗначенияСвойств(ИсключенияНастройкиДоступности.Добавить(), Элемент);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ОписаниеСвойствРеквизитов()
	
	СвойстваРеквизитов = Новый Структура;
	СвойстваРеквизитов.Вставить("ПараметрыКонфигурации",
		бит_НастройкиДоступностиЭлементовФорм.ОписаниеСвойствРеквизитовОбъекта(ОбъектСистемы, АдресТаблицыРеквизитовФормы));
	СвойстваРеквизитов.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки());
		
	Возврат СвойстваРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура УпорядочитьЭлементыПоПредставлению(КоллекцияЭлементовДерева)
	
	ЭлементыДереваДляУпорядочивания = Новый СписокЗначений;
	
	Для каждого СтрокаДерева Из КоллекцияЭлементовДерева Цикл
		ЭлементыДереваДляУпорядочивания.Добавить(СтрокаДерева, СтрокаДерева.Представление);
	КонецЦикла;
	ЭлементыДереваДляУпорядочивания.СортироватьПоПредставлению();
	
	НоваяПозиция = 0;
	Для каждого ЭлементДерева Из ЭлементыДереваДляУпорядочивания Цикл
		ТекущаяПозиция  = КоллекцияЭлементовДерева.Индекс(ЭлементДерева.Значение);
		СмещениеПозиции = НоваяПозиция - ТекущаяПозиция;
		
		Если СмещениеПозиции <> 0 Тогда
			КоллекцияЭлементовДерева.Сдвинуть(ТекущаяПозиция, СмещениеПозиции);
		КонецЕсли;
		
		НоваяПозиция = НоваяПозиция + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДополнительныеРеквзиты(СрокаДерева, СвойстваРеквизитов)
	
	ДопРеквизиты = ДополнительныеРеквизиты();
	Если ДопРеквизиты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДопРеквизитов = СрокаДерева.ПолучитьЭлементы().Добавить();
	СтрокаДопРеквизитов.Представление  = НСтр("ru='Дополнительные реквизиты';en='Additional props'");
	СтрокаДопРеквизитов.ИмяЭлемента    = "ДополнительныеРеквизиты";
	СтрокаДопРеквизитов.ВидЭлемента    = ПредопределенноеЗначение("Перечисление.бит_ВидыЭлементовУправления.ГруппаФормы");
	ЗаполнитьПараметрыСтрокиЭлемента(СтрокаДопРеквизитов, СвойстваРеквизитов);
	
	КоллекцияСтрокДопРеквизитов = СтрокаДопРеквизитов.ПолучитьЭлементы();
	Для каждого ДополнительныйРеквизит Из ДопРеквизиты Цикл
		СтрокаНовогоРеквизита = КоллекцияСтрокДопРеквизитов.Добавить();
		СтрокаНовогоРеквизита.Представление  = ДополнительныйРеквизит.Представление;
		СтрокаНовогоРеквизита.ИмяЭлемента    = ДополнительныйРеквизит.Значение;
		СтрокаНовогоРеквизита.ВидЭлемента    = ПредопределенноеЗначение("Перечисление.бит_ВидыЭлементовУправления.ПолеФормы");
		ЗаполнитьПараметрыСтрокиЭлемента(СтрокаНовогоРеквизита, СвойстваРеквизитов);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДополнительныеРеквизиты()
	
	ИмяНабора = ОбъектСистемы.ИмяОбъектаПолное;
	ИмяНабора = СтрЗаменить(ИмяНабора, ".", "_");
	
	НаборСсылка = УправлениеСвойствами.НаборСвойствПоИмени(ИмяНабора);
	Если НаборСсылка = Неопределено Тогда
		Попытка
			НаборСсылка = Справочники.НаборыДополнительныхРеквизитовИСведений[ИмяНабора];
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборСсылка", НаборСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабДопРеквизиты.Свойство.Наименование КАК Наименование,
	|	ТабДопРеквизиты.Свойство.Имя КАК СвойствоИмя,
	|	ТабДопРеквизиты.Свойство КАК Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ТабДопРеквизиты
	|ГДЕ
	|	ТабДопРеквизиты.Ссылка = &НаборСсылка";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДополнительныеРеквизиты = Новый СписокЗначений;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ИмяЭлемента = "ДополнительныйРеквизитЗначение_"
						+ СтрЗаменить(ВРег(Строка(НаборСсылка.УникальныйИдентификатор())), "-", "x")
						+ "_"
						+ СтрЗаменить(ВРег(Строка(Выборка.Свойство.УникальныйИдентификатор())), "-", "x");
		ДополнительныеРеквизиты.Добавить(ИмяЭлемента, Выборка.Наименование);
	КонецЦикла;
	
	Возврат ДополнительныеРеквизиты;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КоллекцияЭлементовНеБлокироватьСостояниемДокумента");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЭлементов.ИмяЭлемента", ВидСравненияКомпоновкиДанных.ВСписке, ИсключенияНастройкиДоступности);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КоллекцияЭлементовУбратьВидимость");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КоллекцияЭлементовОбязательное");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЭлементов.ВидЭлемента", ВидСравненияКомпоновкиДанных.Равно, Перечисления.бит_ВидыЭлементовУправления.ВсяФорма);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КоллекцияЭлементовУбратьВидимость");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КоллекцияЭлементовТолькоПросмотр");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КоллекцияЭлементовОбязательное");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КоллекцияЭлементовНеБлокироватьСостояниемДокумента");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЭлементов.ВидЭлемента", ВидСравненияКомпоновкиДанных.Равно, Перечисления.бит_ВидыЭлементовУправления.ГруппаФормы);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Функция ПользовательскиеНастройки()
	
	ПользовательскиеНастройки = Новый Соответствие;
	
	Если НЕ ЗначениеЗаполнено(ОбъектСистемы)
		ИЛИ НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат ПользовательскиеНастройки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиДоступности.ИмяЭлементаУправления КАК ИмяЭлементаУправления,
	|	НастройкиДоступности.УбратьВидимость КАК УбратьВидимость,
	|	НастройкиДоступности.ТолькоПросмотр КАК ТолькоПросмотр,
	|	НастройкиДоступности.Обязательное КАК Обязательное,
	|	НастройкиДоступности.НеБлокироватьСостояниемДокумента КАК НеБлокироватьСостояниемДокумента
	|ИЗ
	|	РегистрСведений.бит_НастройкиДоступностиЭлементов КАК НастройкиДоступности
	|ГДЕ
	|	НастройкиДоступности.ОбъектСистемы = &ОбъектСистемы
	|	И НастройкиДоступности.Пользователь = &Пользователь
	|	И НастройкиДоступности.ПроизвольноеУсловие = ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеУсловия.ПустаяСсылка)
	|	И НастройкиДоступности.Статус = ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ОбъектСистемы", ОбъектСистемы);
	Запрос.УстановитьПараметр("Пользователь",  Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗначениеНастройки = Новый Структура("УбратьВидимость,
											|ТолькоПросмотр,
											|Обязательное,
											|НеБлокироватьСостояниемДокумента");
		ЗаполнитьЗначенияСвойств(ЗначениеНастройки, Выборка);
		ПользовательскиеНастройки.Вставить(Выборка.ИмяЭлементаУправления, ЗначениеНастройки);
	КонецЦикла;
	
	Возврат ПользовательскиеНастройки;
	
КонецФункции

&НаСервере
Процедура СохранитьНастройкиДоступности()
	
	Если НЕ ЗначениеЗаполнено(ОбъектСистемы)
		ИЛИ НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли;
	
	Дерево          = РеквизитФормыВЗначение("ДеревоЭлементов");
	ТаблицаНастроек = Новый ТаблицаЗначений;
	Для каждого КолонкаДерева Из Дерево.Колонки Цикл
		ТаблицаНастроек.Колонки.Добавить(КолонкаДерева.Имя, КолонкаДерева.ТипЗначения);
	КонецЦикла;
	ВыгрузитьДеревоНастроекВТаблицу(Дерево, ТаблицаНастроек);
	
	НаборЗаписей = РегистрыСведений.бит_НастройкиДоступностиЭлементов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектСистемы.Установить(ОбъектСистемы);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.ПроизвольноеУсловие.Установить(Справочники.бит_ПользовательскиеУсловия.ПустаяСсылка());
	НаборЗаписей.Отбор.Статус.Установить(Справочники.бит_СтатусыОбъектов.ПустаяСсылка());
	
	Для каждого СтрокаНастроки Из ТаблицаНастроек Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаНастроки);
		Запись.ОбъектСистемы         = ОбъектСистемы;
		Запись.Пользователь          = Пользователь;
		Запись.ИмяЭлементаУправления = СтрокаНастроки.ИмяЭлемента;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьДеревоНастроекВТаблицу(ЭлементРодитель, ТаблицаНастроек)
	
	Для каждого СтрокаДерева Из ЭлементРодитель.Строки Цикл
		Если СтрокаДерева.УбратьВидимость
			ИЛИ СтрокаДерева.ТолькоПросмотр
			ИЛИ СтрокаДерева.Обязательное
			ИЛИ СтрокаДерева.НеБлокироватьСостояниемДокумента Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаНастроек.Добавить(), СтрокаДерева);
		КонецЕсли;
		ВыгрузитьДеревоНастроекВТаблицу(СтрокаДерева, ТаблицаНастроек);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
